blog/2012/03/27/why-lisp-cn.org
#+TITLE: why-lisp-cn

# bhj-tags: lisp programming language
为什么这么多人推崇lisp

我肯定不能代表别人回答为什么他们推崇lisp，最多只代表我自己的一点看法。

是啊，lisp是个相当古老的语言，现存的语言里只有fortran能跟它比老。一般的工程师几乎
接触不到lisp语言，请问有谁做过lisp的项目？这么“out”的语言，为什么还有人推崇它呢？

最早听说lisp、scheme、emacs，如同linux下很多其它知识一样，是从清华王垠那里来的。

不久后读到牛人Eric Raymond的“How To Become A Hacker”，也大力推荐了lisp。他说的好：

#+begin_quote
LISP is worth learning for a different reason — the profound enlightenment
experience you will have when you finally get it. That experience will make you
a better programmer for the rest of your days, even if you never actually use
LISP itself a lot.
#+end_quote

我试着给翻一下：

#+begin_quote
LISP值得学习是因为另一个不一样的原因——你最终学会时那种深奥的顿悟一样的经历。这种
经历会让你一生都成为一个更好的程序员，即使你不经常用得到LISP。
#+end_quote

做为一个Hacker追星族，看到这样的话，我怎能不激动万分、兴致勃勃的开始学LISP？然而很快就发现，LISP好难啊，干看书，怎么
