why-lisp-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>why-lisp-cn</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="why-lisp-cn"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-28T13:20+0800"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="/css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">why-lisp-cn</h1>

<p>为什么这么多人推崇lisp
</p>
<p>
我肯定不能代表别人回答为什么他们推崇lisp，最多只代表我自己的一点看法。
</p>
<p>
是啊，lisp是个相当古老的语言，现存的语言里只有fortran能跟它比老。一般的工程师几乎
接触不到lisp语言，请问有谁做过lisp的项目？这么“out”的语言，为什么还有人推崇它呢？
</p>
<p>
最早听说lisp、scheme、emacs，如同linux下很多其它知识一样，是从清华王垠那里来的。
</p>
<p>
不久后读到牛人Eric Raymond的“How To Become A Hacker”，也大力推荐了lisp。他说的好：
</p>
<blockquote>

<p>LISP is worth learning for a different reason — the profound enlightenment
experience you will have when you finally get it. That experience will make you
a better programmer for the rest of your days, even if you never actually use
LISP itself a lot.
</p>
</blockquote>


<p>
我试着给翻一下：
</p>
<blockquote>

<p>LISP值得学习是因为另一个不一样的原因——你最终学会时那种深奥的顿悟一样的经历。这种
经历会让你一生都成为一个更好的程序员，即使你不经常用得到LISP。
</p>
</blockquote>


<p>
做为一个Hacker追星族，看到这样的话，我怎能不激动万分、兴致勃勃的开始学LISP？然而很快就发现，LISP好难啊，干看书，怎么
      <nav>
        <ul class="pager">
          <li class="prev_post">
            <a href="blog/2012/02/26/extracting-ahd-cn.html"> <!-- prev-url -->
              <i class="icon-chevron-left">《</i>
              extracting-ahd-cn <!-- prev-title -->
            </a>
          </li>
          <li class="next_post" style="text-align: right;">
            <a href="blog/2012/05/02/pdf-for-kindle-touch.html"> <!-- next-url -->
              pdf-for-kindle-touch <!-- next-title -->
              <i class="icon-chevron-right">》</i>
            </a>
          </li>
        </ul>
      </nav>
</p></div>

<div id="postamble">

<div id="disqus_container">
    <a href="#" class="right disqus" onclick="return false;">DISQUS!</a>
    <div style="margin-bottom:20px">
        <script type="text/javascript" charset="utf-8">
        (function(){
          var _w = 86 , _h = 16;
          var param = {
            url:location.href,
            type:'6',
            count:'', /**是否显示分享数，1显示(可选)*/
            appkey:'', /**您申请的应用appkey,显示分享来源(可选)*/
            title:'', /**分享的文字内容(可选，默认为所在页面的title)*/
            pic:'', /**分享图片的路径(可选)*/
            ralateUid:'1611427581', /**关联用户的UID，分享微博会@该用户(可选)*/
            language:'zh_cn', /**设置语言，zh_cn|zh_tw(可选)*/
            rnd:new Date().valueOf()
          }
          var temp = [];
          for( var p in param ){
            temp.push(p + '=' + encodeURIComponent( param[p] || '' ) )
          }
          document.write('<iframe allowTransparency="true" frameborder="0" scrolling="no" src="http://hits.sinajs.cn/A1/weiboshare.html?' + temp.join('&') + '" width="'+ _w+'" height="'+_h+'"></iframe>')
        })()
        </script>
    </div>
    <div id="disqus_thread"></div>
</div>

<script src="/js/post.js" type="text/javascript"></script>

<div id="about">
    <div class="about-content">
        <div class="clearfix">
            <div class="about-left">
                <h2>Contact</h2>
                <div class="weibo-con">
                    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
                </div>
            </div>
            <div class="about-left about-more">
                <h2>Tags</h2>
                                <a href="meta/tags/lisp.html" title="The lisp programming language">lisp</a><br/>
            <a href="meta/tags/programming.html" title="General programming">programming</a><br/>
            <a href="meta/tags/language.html" title="Programming languages">language</a><br/>
            <a href="meta/Archive.html" title="All blogs">archive</a><br/>
            </div>
            <div class="about-left about-more">
                <h2>About</h2>
                <p>
                    Working<a href="http://marvell.com" class="external" target="_blank">@Marvell</a><br/>
                    Code<a href="https://github.com/baohaojun" class="external" target="_blank">@GitHub</a><br/>
                </p>
            </div>
        </div>

        <div class="copyright right">
            <p>Design by <a href="http://baohaojun.github.io/" title="BaoHaojun" target="_blank">Bao Haojun</a> © 2013</p>
        </div>
    </div>
</div>

</div>
</body>
</html>
